** 元字符
1. 对正则表达式的字符进行描述的字符叫做元字符
2. 注意org中js没有babel
   #+begin_src javascript
     var reg=/./gim;//匹配除了换行符以外的字符
     var str="hello\nworld_2023";
     var reuslt=str.replace(reg,"A");
     console.log(result);
    #+end_src
   EL表达式在输出时，寻找对应属性的get方法 ;
   #+begin_src java :results output
      public class Main {
      public static void main(String[] args){
          String str="abc b aaa";
          String reg="[a]*";
           String str1 = str.replaceAll(reg, "A");
           System.out.println(str1);
        }
     }
   #+end_src

   #+RESULTS:
   : AAbAcA AbA AA
  

